[![class](https://img.youtube.com/vi/e6D6onOzJy0/1.jpg)](https://www.youtube.com/watch?v=e6D6onOzJy0&list=PLBHVuYlKEkUKnfbWvRCrwSuSeYh_QUlRl&index=24)
Video

# Lambda function

In [2]:
f = lambda x,y: x+y
f(1,4)

5

In [3]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [4]:
f = lambda x: x ** 2
f(3)

9

In [5]:
(lambda x: x+1)(4)

5

# map(function, sequence)

In [6]:
ex = [1,2,3,4,5]
f = lambda x: x** 2
list(map(f,ex))

[1, 4, 9, 16, 25]

In [7]:
f = lambda x,y:x+y
list(map(f,ex,ex))

[2, 4, 6, 8, 10]

In [8]:
list(map(lambda x: x+x, ex))

[2, 4, 6, 8, 10]

In [9]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [10]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [11]:
z = {1:'A',2:'B',3:'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [12]:
s2 = Series(np.arange(10,20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [13]:
raw_data = {'earn':[79571.299011,96396.988643,48710.666947,80478.096153,82089.345498],
           'height':[73.89,66.23,63.77,63.22,63.08],
           'sex':['male','female','female','female','female'],
           'race':['white','white','white','other','white'],
           'ed':[16,16,16,16,17],
           'age':[49,62,33,95,43]}
df = pd.DataFrame(raw_data,columns=['earn','height','sex','race','ed','age'])
df

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [14]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [15]:
df['sex_code'] = df.sex.map({'male':0,'female':1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [16]:
!wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

--2019-10-25 14:54:58--  https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.228.133
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.228.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 62250 (61K) [text/plain]
Saving to: ‘wages.csv’

wages.csv           100%[===================>]  60.79K   220KB/s    in 0.3s

2019-10-25 14:54:59 (220 KB/s) - ‘wages.csv’ saved [62250/62250]

In [17]:
df = pd.read_csv('./data/wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [18]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [19]:
df['sex_code'] = df.sex.map({'male':0,'female':1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

# Replace function

In [20]:
df.sex.replace(
{'male':0,'female':1}
).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [21]:
df.sex.replace(
    ['male','female'],
    [0,1], inplace=True)
df.head(5)

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [22]:
df = df.drop('sex_code', axis=1)

# apply for dataframe

In [23]:
df_info = df[['earn','height','age']]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [24]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [25]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [26]:
df_info.apply(sum)# also can use std, mean

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [27]:
def f(x):
    return Series([x.min(),x.max()], index=['min','max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

# applymap for dataframe

In [28]:
f = lambda x: -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [29]:
df_info['earn'].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64